added data science project fundamentals to documentation
